{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "eb85add2",
   "metadata": {},
   "source": [
    "**Описание задания**\n",
    "\n",
    "Задание: написать программу, которая поможет пользователям определить, сколько денег они могут сэкономить на покупках в разных магазинах.\n",
    "\n",
    "Условия:\n",
    "\n",
    "Пользователь должен ввести список товаров, которые он собирается купить, и цены на эти товары в разных магазинах.\n",
    "\n",
    "Затем программа должна вывести список магазинов и общую стоимость покупок в каждом магазине, а также сообщить, в каком магазине пользователь может сэкономить больше всего денег.\n",
    "\n",
    "Список товаров и магазинов определяется самостоятельно.\n",
    "\n",
    "Выполненное задание разместите на GitHub."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b3804e89",
   "metadata": {},
   "source": [
    "**Критерии проверки:**<br>\n",
    "<li>Настроен ввод данных со стороны пользователя\t\n",
    "<li>Настроена структура данных о ценах на товары в магазинах\t\n",
    "<li>Настроена структура данных о потребности покупки\t\n",
    "<li>Реализован алгоритм преобразования вводимых данных от пользователя\t\n",
    "<li>Реализован алгоритм сопоставления данных\t\n",
    "<li>Реализован алгоритм вывода результата сверки\t\n",
    "<li>На учебной платформе прикреплена ссылка на GitHub"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "d2a8cd8b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# На вход функции передается список покупок и данные ценам определенного магазина\n",
    "# Если все товары из списка покупок доступны, то возвращаем сумму, иначе \"недоступно\"\n",
    "def check_sum(shopping_list, grocery):\n",
    "    total = 0\n",
    "    for el in shopping_list:\n",
    "        if el[0] in grocery:\n",
    "            total += int(el[1]) * grocery[el[0]]\n",
    "        else:\n",
    "            return -1\n",
    "    return total"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "aefa098c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Считаем сумму в каждом магазине и заносим в список\n",
    "def sum_grocery(shopping_list, groceries):\n",
    "    lst = []\n",
    "    for el in groceries:\n",
    "        sum_gr = check_sum(shopping_list, el[1])\n",
    "        if sum_gr > 0:\n",
    "            lst.append([el[0], sum_gr])\n",
    "    return lst"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "5a170cb4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Продукты, доступные к покупке (некоторые продукты могут быть недоступны в отдельном магазине):\n",
      "хлеб, молоко, сметана, яблоки, кефир, торт, бананы, ананас, киви\n",
      "========================================================================\n",
      "Введите продукт и количество через запятую: . Закончить ввод - любая цифра\n",
      "молоко, 4\n",
      "хлеб, 10\n",
      "сметана, 4\n",
      "1\n",
      "В магазине \"Пятерочка\" покупка Вам обойдется в 1168 руб.\n",
      "В магазине \"Метро\" покупка Вам обойдется в 1202 руб.\n",
      "В магазине \"Лента\" покупка Вам обойдется в 1232 руб.\n",
      "\n",
      "Самая большая экономия будет в магазине \"Пятерочка\"\n"
     ]
    }
   ],
   "source": [
    "# Доступные магазины.\n",
    "names = ['Пятерочка', 'Лента', 'Метро', 'Экзотика', 'За углом']\n",
    "# Данные о ценах на товары в магазинах.\n",
    "prices = [{'хлеб' : 54, 'молоко' : 77, 'сметана' : 80, 'яблоки' : 131, 'кефир' : 94, 'торт' : 512},\\\n",
    "          {'хлеб' : 62, 'молоко' : 76, 'сметана' : 77, 'яблоки' : 160, 'торт' : 480},\\\n",
    "          {'хлеб' : 59, 'молоко' : 81, 'сметана' : 72, 'яблоки' : 120, 'кефир' : 90, 'торт' : 498},\\\n",
    "          {'бананы' : 88, 'ананас' : 300, 'киви' : 110},\\\n",
    "          {'хлеб' : 40, 'молоко' : 65}]\n",
    "# Объединение данных о магазинах и ценах\n",
    "groceries = zip(names, prices)\n",
    "# Получим общий словарь со всеми ключами\n",
    "product = {}\n",
    "for d in prices:\n",
    "    product.update(d)\n",
    "# Ввод списка продуктов, которые хотим приобрести, а также его количества\n",
    "shopping_list = []\n",
    "print(\"Продукты, доступные к покупке (некоторые продукты могут быть недоступны в отдельном магазине):\")\n",
    "print(*product.keys(), sep=', ')\n",
    "print('========================================================================')\n",
    "print(\"Введите продукт и количество через запятую: . Закончить ввод - любая цифра\")\n",
    "while True:\n",
    "    product = input().split(sep=',')\n",
    "    if not product[0].isdigit():\n",
    "        shopping_list.append(product)\n",
    "    else:\n",
    "        break\n",
    "\n",
    "# Получить список сумм покупок в каждом магазине при условии, что продукты в магазине полностью доступны\n",
    "# При недоступности какого-либо товара, магазин исключается из списка доступных\n",
    "lst_sum = sorted(sum_grocery(shopping_list, groceries), key=lambda x: x[1])\n",
    "for el in lst_sum:\n",
    "    print(f'В магазине \"{el[0]}\" покупка Вам обойдется в {el[1]} руб.')\n",
    "print()    \n",
    "if len(lst_sum):\n",
    "    print('Самая большая экономия будет в магазине \"{}\"'.format(lst_sum[0][0]))\n",
    "else:\n",
    "    print('К сожалению, нет магазина, где Вы могли бы купить это все разом')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
